[
  {
    "Name": "A1 Analyse",
    "TheoricalTotal": 11500,
    "Categories": [
      {
        "Name": "A1-1-C1 Besoins",
        "Description": "Analyser les besoins exprimés et problématiques rencontrées par le marché pouvant faire l’objet de la création d’un logiciel en s’appuyant sur une démarche scientifique et méthodique (collecte de faits, hypothèses, identification des parties prenantes et futurs utilisateurs, tests et résultats) et en faisant preuve d’esprit d’analyse et de synthèse afin de faire remonter l’expérience utilisateurs et ainsi définir les objectifs à atteindre.",
        "MaxPoints": 2250
      },

      {
        "Name": "A1-1-C2 Valider",
        "Description": "Valider le besoin identifié sur un marché, en prenant en compte les influences des différentes composantes de l’environnement (technologique -économique – politique – juridique – sociologique – écologique – démographique …) afin de s’assurer de sa véracité, sa faisabilité technique et sa viabilité économique.",
        "MaxPoints": 1250
      },

      {
        "Name": "A1-2-C1 Client",
        "Description": "Analyser la demande du client, en l’interrogeant sur son contexte, ses problématiques liées à son activité, ses enjeux, ses contraintes et ses objectifs afin d’appréhender le périmètre de sa demande et obtenir un premier cadrage du futur logiciel.",
        "MaxPoints": 1250
      },

      {
        "Name": "A1-2-C2 Besoins",
        "Description": "Analyser les besoins opérationnels du client en l’accompagnant dans l’identification des usages et des bénéfices attendus afin de faire émerger les idées de fonctionnalités.",
        "MaxPoints": 2250
      },

      {
        "Name": "A1-3-C1 Accompagner",
        "Description": "Accompagner les entités dirigeantes et parties prenantes du logiciel dans le choix des solutions à développer en relevant les avantages et inconvénients de chacune, en faisant preuve de vulgarisation du langage employé sur les technologies, en confirmant la bonne compréhension des enjeux et des attendus liés au projet de création logicielle pour définir plus précisément les usages qui en seront faits.",
        "MaxPoints": 2250
      },

      {
        "Name": "A1-3-C2 Dossier",
        "Description": "Réaliser un dossier de conception et de développement du logiciel souhaité, en prenant en compte les objectifs définis, les fonctionnalités et spécifications à mettre en œuvre, les coûts inhérents au développement et à l’exploitation du logiciel, tout en restant force de proposition de nouvelles solutions issues d’une veille réalisée sur les innovations du marché afin de formaliser de façon optimale le cahier des charges du projet.",
        "MaxPoints": 2250
      }
    ]
  },

  {
    "Name": "A2 Conception",
    "TheoricalTotal": 9100,
    "Categories": [
      {
        "Name": "A2-1-C1 Concevoir",
        "Description": "Concevoir l’architecture du logiciel souhaité en collaboration avec les équipes de développeurs, en divisant et isolant ses différentes couches (de l’interface utilisateur jusqu’au cœur des règles métier) afin de faciliter le développement, l’évolution, le déploiement et la maintenance de celui-ci.",
        "MaxPoints": 1575
      },

      {
        "Name": "A2-1-C2 Modéliser",
        "Description": "Modéliser les interactions homme-machine nécessaires à l’utilisation efficace du logiciel, en hiérarchisant les informations affichées et définissant l’enchainement des tâches, afin de concevoir une interface utilisateur ergonomique garantissant une expérience utilisateur optimale.",
        "MaxPoints": 875
      },

      {
        "Name": "A2-2-C1 Définir",
        "Description": "Définir l’approche de programmation optimale en choisissant les plateformes, les langages, les algorithmes, les matériels et technologies les plus adaptés en fonction des demandes et des solutions identifiées afin de préparer au mieux le développement du logiciel.",
        "MaxPoints": 875
      },

      {
        "Name": "A2-2-C2 Choisir",
        "Description": "Identifier et choisir l’ensemble des outils, logiciels et ressources (matérielles, budgétaires…) nécessaires au développement du logiciel afin d’organiser de façon optimale l’ensemble des étapes du projet de création et de développement du logiciel.",
        "MaxPoints": 875
      },

      {
        "Name": "A2-2-C3 Sélectionner",
        "Description": "Identifier et sélectionner les compétences complémentaires nécessaires à la réalisation du projet (graphistes, traducteurs, experts métiers…) afin de couvrir, avec une approche pluridisciplinaire, tous les besoins liés au projet de création logicielle.",
        "MaxPoints": 350
      },

      {
        "Name": "A2-2-C4 Vérifier",
        "Description": "Vérifier les conséquences juridiques liées à l’utilisation de logiciels existants, notamment open source, dans la solution finale afin de s’assurer de sa compatibilité avec la politique de licences de l’entreprise.",
        "MaxPoints": 350
      },

      {
        "Name": "A2-3-C1 Anticiper",
        "Description": "Détecter en les anticipant, les risques liés à des inconnues technologiques (maturité, obsolescence, pérennité…) et réglementaires (RGPD, certifications, traçabilité, vie privée) pouvant intervenir lors des différentes phases du projet afin de les éliminer.",
        "MaxPoints": 875
      },

      {
        "Name": "A2-3-C2 Prototyper",
        "Description": "Réaliser les prototypes ou preuves de concept (POC) de nature à dissiper les inconnues technologiques afin de confirmer ou d’infirmer le travail de conception.",
        "MaxPoints": 875
      },

      {
        "Name": "A2-3-C3 Modéliser",
        "Description": "Modéliser l’ensemble des données de l’application afin de faciliter leur manipulation et d’assurer leur persistance ainsi que leur sécurité (intrusion, utilisation malveillante, surface d’attaque…).",
        "MaxPoints": 875
      },

      {
        "Name": "A2-4-C1 Choisir",
        "Description": "Identifier et choisir les briques technologiques les plus adaptées au projet, en sélectionnant celles à créer et celles à utiliser (librairies, open source…), afin d’optimiser le développement (coûts, délais…).",
        "MaxPoints": 1575
      }
    ]
  },

  {
    "Name": "A3 Développement",
    "TheoricalTotal": 21000,
    "Categories": [
      {
        "Name": "A3-1-C1 Rédiger",
        "Description": "Rédiger les plans de test du projet de développement du logiciel en identifiant l’ensemble des tests nécessaires à la vérification du bon fonctionnement du code afin de les exécuter de façon automatisée et systématique et ainsi garantir l’absence de régression.",
        "MaxPoints": 1000
      },

      {
        "Name": "A3-1-C2 Indicateurs",
        "Description": "Elaborer des indicateurs de suivi de production permettant de contrôler le bon fonctionnement du logiciel à grande échelle afin d’anticiper ou de détecter au plus tôt la survenue d’une panne.",
        "MaxPoints": 1000
      },

      {
        "Name": "A3-2-C1 Algorithmes",
        "Description": "Sélectionner ou concevoir les algorithmes les plus pertinents afin de satisfaire les tests unitaires et garantir la stabilité et la performance du système.",
        "MaxPoints": 4500
      },

      {
        "Name": "A3-2-C2-1 Functional",
        "Description": "Functional programming (F#, LINQ, ...)",
        "MaxPoints": 1125
      },

      {
        "Name": "A3-2-C2-2 Imperative",
        "Description": "Imperative programming (C#, Go, Rust, ...)",
        "MaxPoints": 1125
      },

      {
        "Name": "A3-2-C2-3 Dynamic",
        "Description": "Dynamically typed programming languages (JavaScript, HTML, CSS, ...)",
        "MaxPoints": 1125
      },

      {
        "Name": "A3-2-C2-4 AI",
        "Description": "DeepLearning",
        "MaxPoints": 1125
      },

      {
        "Name": "A3-2-C3 Optimiser",
        "Description": "Optimiser le code source du logiciel en réalisant des opérations de « réusinage » et en exploitant les résultats des différents tests réalisés lors de son développement afin d’augmenter la lisibilité et maintenabilité du code et de réduire la consommation des diverses ressources (mémoire, disque, processeur, énergie…) et ainsi garantir sa performance (temps de réponse…).",
        "MaxPoints": 2500
      },

      {
        "Name": "A3-3-C1 Interactions",
        "Description": "Programmer les interactions entre les différents composants visuels de l’interface décrites dans la spécification afin de présenter à l’utilisateur l’information pertinente de façon intuitive.",
        "MaxPoints": 2500
      },

      {
        "Name": "A3-3-C2 Responsivité ",
        "Description": "Assurer l’interactivité et la responsivité du logiciel par l’utilisation de frameworks et langages de programmation adaptés afin de le rendre dynamique et navigable sur les différentes plateformes visées (PC, Mac, mobiles, tablettes …) quelles que soient la taille et l’orientation de l’écran.",
        "MaxPoints": 2500
      },

      {
        "Name": "A3-4-C1 Déployer",
        "Description": "Déployer les solutions techniques retenues pour ne pas introduire de vulnérabilité et réduire au maximum la surface d’attaque.",
        "MaxPoints": 2500
      }
    ]
  },

  {
    "Name": "A4 Test",
    "TheoricalTotal": 7000,
    "Categories": [
      {
        "Name": "A4-1-C1 Concevoir",
        "Description": "Concevoir l’environnement de test, en définissant les indicateurs de performance en fonction des résultats attendus et des facteurs de décisions (montée en charge…) pour valider la cohérence avec le cahier des charges.",
        "MaxPoints": 875
      },

      {
        "Name": "A4-1-C2 Mise en œuvre",
        "Description": "Mettre en œuvre les phases de test béta, en situation réelle auprès d’un échantillon représentatif d’utilisateurs pour permettre de sécuriser le lancement à grande échelle.",
        "MaxPoints": 875
      },

      {
        "Name": "A4-1-C3 Conformité",
        "Description": "Vérifier la conformité des résultats obtenus dans l’environnement final en mettant en œuvre la phase de test d’intégration afin d’assurer la validité de l’aspect fonctionnel, des performances et de la fiabilité du logiciel.",
        "MaxPoints": 875
      },

      {
        "Name": "A4-1-C4 Intrusion",
        "Description": "Mettre en œuvre la phase de test de pénétration (ou intrusion) en simulant des attaques non autorisées en interne et en externe sur les différents niveaux de l’application logicielle afin de vérifier le niveau de sécurité lié à l’accès aux données sensibles de celle-ci.",
        "MaxPoints": 875
      },

      {
        "Name": "A4-1-C5 Jeux d’essais",
        "Description": "Mettre en œuvre les jeux d’essais et de tests du logiciel dans le respect des plans de test élaborés afin d’établir des indicateurs sur la stabilité du logiciel et garantir la satisfaction des utilisateurs.",
        "MaxPoints": 875
      },

      {
        "Name": "A4-2-C1 Automatiser",
        "Description": "Automatiser les tâches récurrentes afin de rendre systématique les étapes de la production du logiciel et ainsi éviter les risques d’erreurs humaines.",
        "MaxPoints": 875
      },

      {
        "Name": "A4-2-C2 Rédiger",
        "Description": "Rédiger les documentations techniques, en français ou en anglais, à destination de l’équipe de maintenance afin de faire le transfert de compétences dans les meilleures conditions, et à destination de l’équipe d’exploitation afin de faciliter le fonctionnement du logiciel au quotidien et de rendre plus efficace la résolution de problèmes.",
        "MaxPoints": 875
      },

      {
        "Name": "A4-2-C3 Mise en production",
        "Description": "Assurer la mise en production du logiciel développé en accompagnant les utilisateurs à le prendre en main, en s’appuyant sur des consignes et conseils d’utilisation, afin d’assurer un déploiement optimal.",
        "MaxPoints": 875
      }
    ]
  },

  {
    "Name": "A5 Maintenance",
    "TheoricalTotal": 3000,
    "Categories": [
      {
        "Name": "A5-1-C1 Corrective",
        "Description": "Assurer la maintenance corrective du logiciel et anticiper l’obsolescence des technologies au travers d’une veille active afin de ne pas accumuler de la dette technique.",
        "MaxPoints": 1000
      },

      {
        "Name": "A5-2-C1 Evolutive",
        "Description": "Assurer la maintenance évolutive du logiciel en s’appuyant sur une veille des nouveaux usages et des nouveaux cyber-risques tout en prenant en compte les retours d’expérience et en saisissant les opportunités d’amélioration du code pour anticiper les attentes du client/marché.",
        "MaxPoints": 1000
      },

      {
        "Name": "A5-3-C1 Suivi",
        "Description": "Assurer la mise à jour de la solution logicielle au regard des évolutions réglementaires afin de lui permettre de maintenir sa conformité (RGPD…).",
        "MaxPoints": 1000
      }
    ]
  },

  {
    "Name": "A6 Management",
    "TheoricalTotal": 8400,
    "Categories": [
      {
        "Name": "A6-1-C1 Responsabilités",
        "Description": "Définir et répartir les tâches, rôles et responsabilités de chaque collaborateur en lien avec le projet de création logicielle, en fixant et en priorisant des indicateurs à suivre (qualité du livrable, dépassement du budget, du temps…) afin de permettre le partage de compétences, d’expériences et d’informations utile à l’atteinte des objectifs individuels et collectifs.",
        "MaxPoints": 1000
      },

      {
        "Name": "A6-1-C2 Outils",
        "Description": "Concevoir des outils de pilotage et de suivi permettant de contrôler la mise en œuvre ou l’adaptation du projet en collaborant avec des développeurs présents ou à distance afin d’assurer l’atteinte des objectifs visés en termes de qualité et délais définis par le cahier des charges.",
        "MaxPoints": 400
      },

      {
        "Name": "A6-1-C3 Indicateurs",
        "Description": "Assurer le suivi des indicateurs et la rédaction des rapports afin d’assurer à toutes les parties prenantes l’accès au même niveau d’information et de les alerter le cas échéant.",
        "MaxPoints": 400
      },

      {
        "Name": "A6-2-C1 Veille",
        "Description": "Réaliser une veille technologique sur les innovations permettant d’apporter des plus-values à la solution logicielle en vue d’intégrer de nouvelles fonctionnalités ou des gains d’efficacité.",
        "MaxPoints": 400
      },

      {
        "Name": "A6-2-C2 Opportunités",
        "Description": "Décider et mettre en œuvre les nouvelles opportunités identifiées par le travail de veille, auprès des développeurs tout en faisant valider leur pertinence.",
        "MaxPoints": 400
      },

      {
        "Name": "A6-3-C1 Organiser",
        "Description": "Organiser la collaboration de l’équipe en télétravail ou en face à face, en permettant à chacun d’exprimer ses idées et de proposer des solutions aux difficultés rencontrées afin de renforcer le travail coopératif.",
        "MaxPoints": 1000
      },

      {
        "Name": "A6-3-C2 Collaboration",
        "Description": "Elaborer les conventions et règles de fonctionnement destinées à l’équipe en charge du développement du logiciel (étapes clés, styles de code à employer, bonnes pratiques à respecter…) afin d’assurer un travail collaboratif efficace garant de l’atteinte des objectifs fixés.",
        "MaxPoints": 1800
      },

      {
        "Name": "A6-3-C3 Prévenir",
        "Description": "Prévenir et gérer l’ensemble des risques et des imprévus (situations difficiles, conflits…) en adaptant avec agilité et créativité les étapes et les actions du projet afin d’apporter des solutions partagées et ainsi assurer la continuité du projet dans des conditions optimales.",
        "MaxPoints": 1000
      },

      {
        "Name": "A6-3-C4 Productivité",
        "Description": "Identifier les gains de productivité possibles en lien avec les parties prenantes dédiées au projet en détectant les opportunités d’automatisation des différentes tâches et activités réalisées ou à réaliser afin d’assurer l’atteinte des objectifs dans les délais imposés.",
        "MaxPoints": 1000
      },

      {
        "Name": "A6-4-C1 Parties prenantes",
        "Description": "Transmettre les messages auprès des différentes parties prenantes, en prenant soin d’adapter son vocabulaire au niveau de connaissances de ses interlocuteurs, en vulgarisant si nécessaire les informations techniques pour permettre une communication fluide et efficace.",
        "MaxPoints": 1000
      }
    ]
  },

  {
    "Name": "A7 English",
    "TheoricalTotal": 20000,
    "Categories": [
      {
        "Name": "A7-1-1 Précision",
        "Description": "Exprimer ses idées avec précision",
        "MaxPoints": 2000
      },

      {
        "Name": "A7-1-2 Vocabulaire",
        "Description": "Utiliser un vocabulaire riche",
        "MaxPoints": 2000
      },

      {
        "Name": "A7-1-3 TED",
        "Description": "Animer des TED Talks",
        "MaxPoints": 2000
      },

      {
        "Name": "A7-2-1 Media",
        "Description": "Comprendre tout type de supports audio ou vidéo",
        "MaxPoints": 2000
      },

      {
        "Name": "A7-2-2 Accents",
        "Description": "Comprendre les accents inhabituels",
        "MaxPoints": 2000
      },

      {
        "Name": "A7-3-1 Precision",
        "Description": "Exprimer ses idées avec précision",
        "MaxPoints": 2000
      },

      {
        "Name": "A7-3-2 Vocabulary",
        "Description": "Utiliser un vocabulaire riche",
        "MaxPoints": 2000
      },

      {
        "Name": "A7-3-3 Structure",
        "Description": "Rédiger et structurer un texte",
        "MaxPoints": 2000
      },

      {
        "Name": "A7-4-1 Complex",
        "Description": "Comprendre des textes longs et complexes",
        "MaxPoints": 2000
      },

      {
        "Name": "A7-4-2 Vocabulary",
        "Description": "Maîtriser un vocabulaire riche",
        "MaxPoints": 2000
      }
    ]
  },

  {
    "Name": "A8 Soft Skills",
    "TheoricalTotal": 20020,
    "Categories": [
      {
        "Name": "A8-1-1 Confiance",
        "Description": "Avoir confiance en soi et s’affirmer",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-1-2-1 Reading List",
        "Description": "Reading List",
        "MaxPoints": 300
      },

      {
        "Name": "A8-1-3 Entreprendre",
        "Description": "Entreprendre, oser, se lancer",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-1-4 Se connaître",
        "Description": "Se connaître pour révéler son potentiel",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-1-5 Savoir-être",
        "Description": "Se démarquer par son savoir-être",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-2-1 Orale",
        "Description": "Communiquer efficacement à l’oral",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-2-2 Ecrite",
        "Description": "Communiquer efficacement à l’écrit",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-2-3 Différences culturelles",
        "Description": "Comprendre les différences culturelles",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-2-4 e-reputation",
        "Description": "Maîtriser sa e-reputation",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-3-1 Reformuler",
        "Description": "Poser et reformuler des problèmes ",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-3-2 Décomposer",
        "Description": "Décomposer des problèmes",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-3-3 Curiosité/Créativité",
        "Description": "Faire preuve de curiosité et créativité.",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-3-4 Visualiser",
        "Description": "Visualiser un problème à plusieurs échelles",
        "MaxPoints": 1430
      },

      {
        "Name": "A8-3-5 Généraliser",
        "Description": "Transformer des cas particuliers en règles génériques",
        "MaxPoints": 1430
      }
    ]
  }
]